; domain
(define (domain barman)
  (:requirements :strips :typing)
  (:types hand level beverage dispenser container - object
  	  ingredient cocktail - beverage
          shot shaker - container)
  (:predicates  (ontable ?c - container)
                (holding ?h - hand ?c - container)
		(handempty ?h - hand)
		(empty ?c - container)
                (contains ?c - container ?b - beverage)
		(clean ?c - container)
                (used ?c - container ?b - beverage)
                (dispenses ?d - dispenser ?i - ingredient)
		(shaker-empty-level ?s - shaker ?l - level)
		(shaker-level ?s - shaker ?l - level)
		(next ?l1 ?l2 - level)
		(unshaked ?s - shaker)
		(shaked ?s - shaker)
                (cocktail-part1 ?c - cocktail ?i - ingredient)
                (cocktail-part2 ?c - cocktail ?i - ingredient))
		
  (:action grasp
             :parameters (?h - hand ?c - container)
             :precondition (and (ontable ?c) (handempty ?h))
             :effect (and (not (ontable ?c))
	     	     	  (not (handempty ?h))
			  (holding ?h ?c)))

  (:action leave
             :parameters (?h - hand ?c - container)
             :precondition (holding ?h ?c)
             :effect (and (not (holding ?h ?c))
	     	     	  (handempty ?h)
			  (ontable ?c)))
  
  (:action fill-shot
           :parameters (?s - shot ?i - ingredient ?h1 ?h2 - hand ?d - dispenser)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
	   		      (dispenses ?d ?i)
                              (empty ?s)
			      (clean ?s))
           :effect (and (not (empty ?s))
	   	   	(contains ?s ?i)
	   	   	(not (clean ?s))
			(used ?s ?i)))


  (:action refill-shot
           :parameters (?s - shot ?i - ingredient ?h1 ?h2 - hand ?d - dispenser)
           :precondition (and (holding ?h1 ?s)	   		      
                              (handempty ?h2)
	   		      (dispenses ?d ?i)
                              (empty ?s)
			      (used ?s ?i))
           :effect (and (not (empty ?s))
                        (contains ?s ?i)))

  (:action empty-shot
           :parameters (?h - hand ?p - shot ?b - beverage)
           :precondition (and (holding ?h ?p)
                              (contains ?p ?b))
           :effect (and (not (contains ?p ?b))
	   	   	(empty ?p)))

  (:action clean-shot
  	   :parameters (?s - shot ?b - beverage ?h1 ?h2 - hand)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)	   		      
			      (empty ?s)
                              (used ?s ?b))
           :effect (and (not (used ?s ?b))
	   	   	(clean ?s)))

  (:action pour-shot-to-clean-shaker
           :parameters (?s - shot ?i - ingredient ?d - shaker ?h1 - hand ?l ?l1 - level)
           :precondition (and (holding ?h1 ?s)
			      (contains ?s ?i)
                              (empty ?d)
	   		      (clean ?d)                              
                              (shaker-level ?d ?l)
                              (next ?l ?l1))
           :effect (and (not (contains ?s ?i))
	   	   	(empty ?s)
			(contains ?d ?i)
                        (not (empty ?d))
			(not (clean ?d))
			(unshaked ?d)
			(not (shaker-level ?d ?l))
			(shaker-level ?d ?l1)))


  (:action pour-shot-to-used-shaker
           :parameters (?s - shot ?i - ingredient ?d - shaker ?h1 - hand ?l ?l1 - level)
           :precondition (and (holding ?h1 ?s)
			      (contains ?s ?i)
                              (unshaked ?d)
                              (shaker-level ?d ?l)
                              (next ?l ?l1))
           :effect (and (not (contains ?s ?i))
                        (contains ?d ?i)
	   	   	(empty ?s)     
  			(not (shaker-level ?d ?l))
			(shaker-level ?d ?l1)))

  (:action empty-shaker
           :parameters (?h - hand ?s - shaker ?b - cocktail ?l ?l1 - level)
           :precondition (and (holding ?h ?s)
                              (contains ?s ?b)
			      (shaked ?s)
			      (shaker-level ?s ?l)
			      (shaker-empty-level ?s ?l1))
           :effect (and (not (shaked ?s))
	   	   	(not (shaker-level ?s ?l))
	   	   	(shaker-level ?s ?l1)
			(not (contains ?s ?b))
	   	   	(empty ?s)))

  (:action clean-shaker
  	   :parameters (?h1 ?h2 - hand ?s - shaker)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
                              (empty ?s))
           :effect (and (clean ?s)))
  
  (:action shake
  	   :parameters (?b - cocktail ?d1 ?d2 - ingredient ?s - shaker ?h1 ?h2 - hand)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
			      (contains ?s ?d1)
                              (contains ?s ?d2)
                              (cocktail-part1 ?b ?d1)
			      (cocktail-part2 ?b ?d2)
			      (unshaked ?s))			      
           :effect (and (not (unshaked ?s))
		        (not (contains ?s ?d1))
                        (not (contains ?s ?d2))
	   	   	(shaked ?s)
                        (contains ?s ?b)))

  (:action pour-shaker-to-shot
           :parameters (?b - beverage ?d - shot ?h - hand ?s - shaker ?l ?l1 - level)
           :precondition (and (holding ?h ?s)
			      (shaked ?s)
			      (empty ?d)
			      (clean ?d)
			      (contains ?s ?b)
                              (shaker-level ?s ?l)
                              (next ?l1 ?l))
           :effect (and (not (clean ?d))
	   	   	(not (empty ?d))
			(contains ?d ?b)
			(shaker-level ?s ?l1)
			(not (shaker-level ?s ?l))))
 )

; problem
(define (problem prob)
 (:domain barman)
 (:objects 
     shaker1 - shaker
     left right - hand
     shot1 shot2 shot3 shot4 shot5 shot6 shot7 shot8 shot9 shot10 shot11 shot12 - shot
     ingredient1 ingredient2 ingredient3 ingredient4 ingredient5 ingredient6 - ingredient
     cocktail1 cocktail2 cocktail3 cocktail4 cocktail5 cocktail6 - cocktail
     dispenser1 dispenser2 dispenser3 dispenser4 dispenser5 dispenser6 - dispenser
     l0 l1 l2 - level
)
 (:init 
  (ontable shaker1)
  (ontable shot1)
  (ontable shot2)
  (ontable shot3)
  (ontable shot4)
  (ontable shot5)
  (ontable shot6)
  (ontable shot7)
  (ontable shot8)
  (ontable shot9)
  (ontable shot10)
  (ontable shot11)
  (ontable shot12)
  (dispenses dispenser1 ingredient1)
  (dispenses dispenser2 ingredient2)
  (dispenses dispenser3 ingredient3)
  (dispenses dispenser4 ingredient4)
  (dispenses dispenser5 ingredient5)
  (dispenses dispenser6 ingredient6)
  (clean shaker1)
  (clean shot1)
  (clean shot2)
  (clean shot3)
  (clean shot4)
  (clean shot5)
  (clean shot6)
  (clean shot7)
  (clean shot8)
  (clean shot9)
  (clean shot10)
  (clean shot11)
  (clean shot12)
  (empty shaker1)
  (empty shot1)
  (empty shot2)
  (empty shot3)
  (empty shot4)
  (empty shot5)
  (empty shot6)
  (empty shot7)
  (empty shot8)
  (empty shot9)
  (empty shot10)
  (empty shot11)
  (empty shot12)
  (handempty left)
  (handempty right)
  (shaker-empty-level shaker1 l0)
  (shaker-level shaker1 l0)
  (next l0 l1)
  (next l1 l2)
  (cocktail-part1 cocktail1 ingredient4)
  (cocktail-part2 cocktail1 ingredient5)
  (cocktail-part1 cocktail2 ingredient6)
  (cocktail-part2 cocktail2 ingredient1)
  (cocktail-part1 cocktail3 ingredient6)
  (cocktail-part2 cocktail3 ingredient5)
  (cocktail-part1 cocktail4 ingredient6)
  (cocktail-part2 cocktail4 ingredient5)
  (cocktail-part1 cocktail5 ingredient4)
  (cocktail-part2 cocktail5 ingredient2)
  (cocktail-part1 cocktail6 ingredient3)
  (cocktail-part2 cocktail6 ingredient4)
)
 (:goal
  (and
     (contains shot1 cocktail4)
     (contains shot2 cocktail6)
     (contains shot3 cocktail3)
     (contains shot4 cocktail1)
     (contains shot5 cocktail2)
     (contains shot6 cocktail5)
     (contains shot7 ingredient3)
     (contains shot8 ingredient5)
     (contains shot9 cocktail6)
     (contains shot10 cocktail6)
     (contains shot11 ingredient1)
)))

; plan
1. (grasp left shot7)
   deleted: (ontable shot7) (handempty left)
   added: (holding left shot7)
   goals met: 0 of 11
2. (fill-shot shot7 ingredient3 left right dispenser3)
   deleted: (empty shot7) (clean shot7)
   added: (contains shot7 ingredient3) (used shot7 ingredient3)
   goals met: 1 of 11
3. (grasp right shaker1)
   deleted: (ontable shaker1) (handempty right)
   added: (holding right shaker1)
   goals met: 1 of 11
4. (pour-shot-to-clean-shaker shot7 ingredient3 shaker1 left l0 l1)
   deleted: (contains shot7 ingredient3) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot7) (contains shaker1 ingredient3) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 0 of 11
5. (leave left shot7)
   deleted: (holding left shot7)
   added: (handempty left) (ontable shot7)
   goals met: 0 of 11
6. (leave right shaker1)
   deleted: (holding right shaker1)
   added: (handempty right) (ontable shaker1)
   goals met: 0 of 11
7. (grasp left shot8)
   deleted: (ontable shot8) (handempty left)
   added: (holding left shot8)
   goals met: 0 of 11
8. (fill-shot shot8 ingredient5 left right dispenser5)
   deleted: (empty shot8) (clean shot8)
   added: (contains shot8 ingredient5) (used shot8 ingredient5)
   goals met: 1 of 11
9. (grasp right shot7)
   deleted: (ontable shot7) (handempty right)
   added: (holding right shot7)
   goals met: 1 of 11
10. (leave left shot8)
   deleted: (holding left shot8)
   added: (handempty left) (ontable shot8)
   goals met: 1 of 11
11. (refill-shot shot7 ingredient3 right left dispenser3)
   deleted: (empty shot7)
   added: (contains shot7 ingredient3)
   goals met: 2 of 11
12. (leave right shot7)
   deleted: (holding right shot7)
   added: (handempty right) (ontable shot7)
   goals met: 2 of 11
13. (grasp right shot11)
   deleted: (ontable shot11) (handempty right)
   added: (holding right shot11)
   goals met: 2 of 11
14. (fill-shot shot11 ingredient4 right left dispenser4)
   deleted: (empty shot11) (clean shot11)
   added: (contains shot11 ingredient4) (used shot11 ingredient4)
   goals met: 2 of 11
15. (pour-shot-to-used-shaker shot11 ingredient4 shaker1 right l1 l2)
   deleted: (contains shot11 ingredient4) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient4) (empty shot11) (shaker-level shaker1 l2)
   goals met: 2 of 11
16. (clean-shot shot11 ingredient4 right left)
   deleted: (used shot11 ingredient4)
   added: (clean shot11)
   goals met: 2 of 11
17. (fill-shot shot11 ingredient1 right left dispenser1)
   deleted: (empty shot11) (clean shot11)
   added: (contains shot11 ingredient1) (used shot11 ingredient1)
   goals met: 3 of 11
18. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 3 of 11
19. (leave right shot11)
   deleted: (holding right shot11)
   added: (handempty right) (ontable shot11)
   goals met: 3 of 11
20. (shake cocktail6 ingredient3 ingredient4 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient3) (contains shaker1 ingredient4)
   added: (shaked shaker1) (contains shaker1 cocktail6)
   goals met: 3 of 11
21. (pour-shaker-to-shot cocktail6 shot10 left shaker1 l2 l1)
   deleted: (clean shot10) (empty shot10) (shaker-level shaker1 l2)
   added: (contains shot10 cocktail6) (shaker-level shaker1 l1)
   goals met: 4 of 11
22. (pour-shaker-to-shot cocktail6 shot2 left shaker1 l1 l0)
   deleted: (clean shot2) (empty shot2) (shaker-level shaker1 l1)
   added: (contains shot2 cocktail6) (shaker-level shaker1 l0)
   goals met: 5 of 11
23. (empty-shaker left shaker1 cocktail6 l0 l0)
   deleted: (shaked shaker1) (contains shaker1 cocktail6)
   added: (empty shaker1)
   goals met: 5 of 11
24. (clean-shaker left right shaker1)
   added: (clean shaker1)
   goals met: 5 of 11
25. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 5 of 11
26. (grasp right shot11)
   deleted: (ontable shot11) (handempty right)
   added: (holding right shot11)
   goals met: 5 of 11
27. (pour-shot-to-clean-shaker shot11 ingredient1 shaker1 right l0 l1)
   deleted: (contains shot11 ingredient1) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot11) (contains shaker1 ingredient1) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 4 of 11
28. (clean-shot shot11 ingredient1 right left)
   deleted: (used shot11 ingredient1)
   added: (clean shot11)
   goals met: 4 of 11
29. (fill-shot shot11 ingredient6 right left dispenser6)
   deleted: (empty shot11) (clean shot11)
   added: (contains shot11 ingredient6) (used shot11 ingredient6)
   goals met: 4 of 11
30. (pour-shot-to-used-shaker shot11 ingredient6 shaker1 right l1 l2)
   deleted: (contains shot11 ingredient6) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient6) (empty shot11) (shaker-level shaker1 l2)
   goals met: 4 of 11
31. (clean-shot shot11 ingredient6 right left)
   deleted: (used shot11 ingredient6)
   added: (clean shot11)
   goals met: 4 of 11
32. (fill-shot shot11 ingredient1 right left dispenser1)
   deleted: (empty shot11) (clean shot11)
   added: (contains shot11 ingredient1) (used shot11 ingredient1)
   goals met: 5 of 11
33. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 5 of 11
34. (leave right shot11)
   deleted: (holding right shot11)
   added: (handempty right) (ontable shot11)
   goals met: 5 of 11
35. (shake cocktail2 ingredient6 ingredient1 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient6) (contains shaker1 ingredient1)
   added: (shaked shaker1) (contains shaker1 cocktail2)
   goals met: 5 of 11
36. (pour-shaker-to-shot cocktail2 shot5 left shaker1 l2 l1)
   deleted: (clean shot5) (empty shot5) (shaker-level shaker1 l2)
   added: (contains shot5 cocktail2) (shaker-level shaker1 l1)
   goals met: 6 of 11
37. (empty-shaker left shaker1 cocktail2 l1 l0)
   deleted: (shaked shaker1) (shaker-level shaker1 l1) (contains shaker1 cocktail2)
   added: (shaker-level shaker1 l0) (empty shaker1)
   goals met: 6 of 11
38. (clean-shaker left right shaker1)
   added: (clean shaker1)
   goals met: 6 of 11
39. (grasp right shot7)
   deleted: (ontable shot7) (handempty right)
   added: (holding right shot7)
   goals met: 6 of 11
40. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 6 of 11
41. (pour-shot-to-clean-shaker shot7 ingredient3 shaker1 right l0 l1)
   deleted: (contains shot7 ingredient3) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot7) (contains shaker1 ingredient3) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 5 of 11
42. (clean-shot shot7 ingredient3 right left)
   deleted: (used shot7 ingredient3)
   added: (clean shot7)
   goals met: 5 of 11
43. (fill-shot shot7 ingredient4 right left dispenser4)
   deleted: (empty shot7) (clean shot7)
   added: (contains shot7 ingredient4) (used shot7 ingredient4)
   goals met: 5 of 11
44. (pour-shot-to-used-shaker shot7 ingredient4 shaker1 right l1 l2)
   deleted: (contains shot7 ingredient4) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient4) (empty shot7) (shaker-level shaker1 l2)
   goals met: 5 of 11
45. (clean-shot shot7 ingredient4 right left)
   deleted: (used shot7 ingredient4)
   added: (clean shot7)
   goals met: 5 of 11
46. (fill-shot shot7 ingredient3 right left dispenser3)
   deleted: (empty shot7) (clean shot7)
   added: (contains shot7 ingredient3) (used shot7 ingredient3)
   goals met: 6 of 11
47. (leave right shot7)
   deleted: (holding right shot7)
   added: (handempty right) (ontable shot7)
   goals met: 6 of 11
48. (grasp right shaker1)
   deleted: (ontable shaker1) (handempty right)
   added: (holding right shaker1)
   goals met: 6 of 11
49. (shake cocktail6 ingredient3 ingredient4 shaker1 right left)
   deleted: (unshaked shaker1) (contains shaker1 ingredient3) (contains shaker1 ingredient4)
   added: (shaked shaker1) (contains shaker1 cocktail6)
   goals met: 6 of 11
50. (pour-shaker-to-shot cocktail6 shot9 right shaker1 l2 l1)
   deleted: (clean shot9) (empty shot9) (shaker-level shaker1 l2)
   added: (contains shot9 cocktail6) (shaker-level shaker1 l1)
   goals met: 7 of 11
51. (empty-shaker right shaker1 cocktail6 l1 l0)
   deleted: (shaked shaker1) (shaker-level shaker1 l1) (contains shaker1 cocktail6)
   added: (shaker-level shaker1 l0) (empty shaker1)
   goals met: 7 of 11
52. (clean-shaker right left shaker1)
   added: (clean shaker1)
   goals met: 7 of 11
53. (grasp left shot8)
   deleted: (ontable shot8) (handempty left)
   added: (holding left shot8)
   goals met: 7 of 11
54. (leave right shaker1)
   deleted: (holding right shaker1)
   added: (handempty right) (ontable shaker1)
   goals met: 7 of 11
55. (grasp right shot6)
   deleted: (ontable shot6) (handempty right)
   added: (holding right shot6)
   goals met: 7 of 11
56. (leave left shot8)
   deleted: (holding left shot8)
   added: (handempty left) (ontable shot8)
   goals met: 7 of 11
57. (fill-shot shot6 ingredient2 right left dispenser2)
   deleted: (empty shot6) (clean shot6)
   added: (contains shot6 ingredient2) (used shot6 ingredient2)
   goals met: 7 of 11
58. (pour-shot-to-clean-shaker shot6 ingredient2 shaker1 right l0 l1)
   deleted: (contains shot6 ingredient2) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot6) (contains shaker1 ingredient2) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 7 of 11
59. (clean-shot shot6 ingredient2 right left)
   deleted: (used shot6 ingredient2)
   added: (clean shot6)
   goals met: 7 of 11
60. (fill-shot shot6 ingredient4 right left dispenser4)
   deleted: (empty shot6) (clean shot6)
   added: (contains shot6 ingredient4) (used shot6 ingredient4)
   goals met: 7 of 11
61. (pour-shot-to-used-shaker shot6 ingredient4 shaker1 right l1 l2)
   deleted: (contains shot6 ingredient4) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient4) (empty shot6) (shaker-level shaker1 l2)
   goals met: 7 of 11
62. (clean-shot shot6 ingredient4 right left)
   deleted: (used shot6 ingredient4)
   added: (clean shot6)
   goals met: 7 of 11
63. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 7 of 11
64. (leave right shot6)
   deleted: (holding right shot6)
   added: (handempty right) (ontable shot6)
   goals met: 7 of 11
65. (shake cocktail5 ingredient4 ingredient2 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient4) (contains shaker1 ingredient2)
   added: (shaked shaker1) (contains shaker1 cocktail5)
   goals met: 7 of 11
66. (pour-shaker-to-shot cocktail5 shot6 left shaker1 l2 l1)
   deleted: (clean shot6) (empty shot6) (shaker-level shaker1 l2)
   added: (contains shot6 cocktail5) (shaker-level shaker1 l1)
   goals met: 8 of 11
67. (empty-shaker left shaker1 cocktail5 l1 l0)
   deleted: (shaked shaker1) (shaker-level shaker1 l1) (contains shaker1 cocktail5)
   added: (shaker-level shaker1 l0) (empty shaker1)
   goals met: 8 of 11
68. (clean-shaker left right shaker1)
   added: (clean shaker1)
   goals met: 8 of 11
69. (grasp right shot8)
   deleted: (ontable shot8) (handempty right)
   added: (holding right shot8)
   goals met: 8 of 11
70. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 8 of 11
71. (pour-shot-to-clean-shaker shot8 ingredient5 shaker1 right l0 l1)
   deleted: (contains shot8 ingredient5) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot8) (contains shaker1 ingredient5) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 7 of 11
72. (refill-shot shot8 ingredient5 right left dispenser5)
   deleted: (empty shot8)
   added: (contains shot8 ingredient5)
   goals met: 8 of 11
73. (grasp left shot12)
   deleted: (ontable shot12) (handempty left)
   added: (holding left shot12)
   goals met: 8 of 11
74. (leave right shot8)
   deleted: (holding right shot8)
   added: (handempty right) (ontable shot8)
   goals met: 8 of 11
75. (fill-shot shot12 ingredient4 left right dispenser4)
   deleted: (empty shot12) (clean shot12)
   added: (contains shot12 ingredient4) (used shot12 ingredient4)
   goals met: 8 of 11
76. (pour-shot-to-used-shaker shot12 ingredient4 shaker1 left l1 l2)
   deleted: (contains shot12 ingredient4) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient4) (empty shot12) (shaker-level shaker1 l2)
   goals met: 8 of 11
77. (clean-shot shot12 ingredient4 left right)
   deleted: (used shot12 ingredient4)
   added: (clean shot12)
   goals met: 8 of 11
78. (fill-shot shot12 ingredient6 left right dispenser6)
   deleted: (empty shot12) (clean shot12)
   added: (contains shot12 ingredient6) (used shot12 ingredient6)
   goals met: 8 of 11
79. (grasp right shaker1)
   deleted: (ontable shaker1) (handempty right)
   added: (holding right shaker1)
   goals met: 8 of 11
80. (leave left shot12)
   deleted: (holding left shot12)
   added: (handempty left) (ontable shot12)
   goals met: 8 of 11
81. (shake cocktail1 ingredient4 ingredient5 shaker1 right left)
   deleted: (unshaked shaker1) (contains shaker1 ingredient4) (contains shaker1 ingredient5)
   added: (shaked shaker1) (contains shaker1 cocktail1)
   goals met: 8 of 11
82. (pour-shaker-to-shot cocktail1 shot4 right shaker1 l2 l1)
   deleted: (clean shot4) (empty shot4) (shaker-level shaker1 l2)
   added: (contains shot4 cocktail1) (shaker-level shaker1 l1)
   goals met: 9 of 11
83. (empty-shaker right shaker1 cocktail1 l1 l0)
   deleted: (shaked shaker1) (shaker-level shaker1 l1) (contains shaker1 cocktail1)
   added: (shaker-level shaker1 l0) (empty shaker1)
   goals met: 9 of 11
84. (clean-shaker right left shaker1)
   added: (clean shaker1)
   goals met: 9 of 11
85. (grasp left shot8)
   deleted: (ontable shot8) (handempty left)
   added: (holding left shot8)
   goals met: 9 of 11
86. (pour-shot-to-clean-shaker shot8 ingredient5 shaker1 left l0 l1)
   deleted: (contains shot8 ingredient5) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot8) (contains shaker1 ingredient5) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 8 of 11
87. (leave right shaker1)
   deleted: (holding right shaker1)
   added: (handempty right) (ontable shaker1)
   goals met: 8 of 11
88. (refill-shot shot8 ingredient5 left right dispenser5)
   deleted: (empty shot8)
   added: (contains shot8 ingredient5)
   goals met: 9 of 11
89. (leave left shot8)
   deleted: (holding left shot8)
   added: (handempty left) (ontable shot8)
   goals met: 9 of 11
90. (grasp right shot12)
   deleted: (ontable shot12) (handempty right)
   added: (holding right shot12)
   goals met: 9 of 11
91. (pour-shot-to-used-shaker shot12 ingredient6 shaker1 right l1 l2)
   deleted: (contains shot12 ingredient6) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient6) (empty shot12) (shaker-level shaker1 l2)
   goals met: 9 of 11
92. (refill-shot shot12 ingredient6 right left dispenser6)
   deleted: (empty shot12)
   added: (contains shot12 ingredient6)
   goals met: 9 of 11
93. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 9 of 11
94. (leave right shot12)
   deleted: (holding right shot12)
   added: (handempty right) (ontable shot12)
   goals met: 9 of 11
95. (shake cocktail4 ingredient6 ingredient5 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient6) (contains shaker1 ingredient5)
   added: (shaked shaker1) (contains shaker1 cocktail4)
   goals met: 9 of 11
96. (pour-shaker-to-shot cocktail4 shot1 left shaker1 l2 l1)
   deleted: (clean shot1) (empty shot1) (shaker-level shaker1 l2)
   added: (contains shot1 cocktail4) (shaker-level shaker1 l1)
   goals met: 10 of 11
97. (grasp right shot12)
   deleted: (ontable shot12) (handempty right)
   added: (holding right shot12)
   goals met: 10 of 11
98. (empty-shaker left shaker1 cocktail4 l1 l0)
   deleted: (shaked shaker1) (shaker-level shaker1 l1) (contains shaker1 cocktail4)
   added: (shaker-level shaker1 l0) (empty shaker1)
   goals met: 10 of 11
99. (leave right shot12)
   deleted: (holding right shot12)
   added: (handempty right) (ontable shot12)
   goals met: 10 of 11
100. (clean-shaker left right shaker1)
   added: (clean shaker1)
   goals met: 10 of 11
101. (grasp right shot8)
   deleted: (ontable shot8) (handempty right)
   added: (holding right shot8)
   goals met: 10 of 11
102. (pour-shot-to-clean-shaker shot8 ingredient5 shaker1 right l0 l1)
   deleted: (contains shot8 ingredient5) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot8) (contains shaker1 ingredient5) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 9 of 11
103. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 9 of 11
104. (refill-shot shot8 ingredient5 right left dispenser5)
   deleted: (empty shot8)
   added: (contains shot8 ingredient5)
   goals met: 10 of 11
105. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 10 of 11
106. (leave right shot8)
   deleted: (holding right shot8)
   added: (handempty right) (ontable shot8)
   goals met: 10 of 11
107. (grasp right shot12)
   deleted: (ontable shot12) (handempty right)
   added: (holding right shot12)
   goals met: 10 of 11
108. (pour-shot-to-used-shaker shot12 ingredient6 shaker1 right l1 l2)
   deleted: (contains shot12 ingredient6) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient6) (empty shot12) (shaker-level shaker1 l2)
   goals met: 10 of 11
109. (leave right shot12)
   deleted: (holding right shot12)
   added: (handempty right) (ontable shot12)
   goals met: 10 of 11
110. (shake cocktail3 ingredient6 ingredient5 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient6) (contains shaker1 ingredient5)
   added: (shaked shaker1) (contains shaker1 cocktail3)
   goals met: 10 of 11
111. (pour-shaker-to-shot cocktail3 shot3 left shaker1 l2 l1)
   deleted: (clean shot3) (empty shot3) (shaker-level shaker1 l2)
   added: (contains shot3 cocktail3) (shaker-level shaker1 l1)
   goals met: 11 of 11
